<?php
/**
 * Plugin Name: Hello WooCommerce
 * Description: نمایش جملات تصادفی روی محصولات ووکامرسه 
 * Version: 1.0
 * Author: sadra
 */



if ( ! defined( 'WPINC' ) ) {
	die;
}

        
        /*این کد یه تابع هستش برای تولید جمله های تصادفی*/
        function random_alert() {
            $alert = [
                "امروز بهترین روز برای خرید شماست!",
                "فرصت رو از دست نده، همین حالا سفارش بده!",
                "یک انتخاب هوشمندانه برای شما!",
                "این محصول میتونه زندگی‌تو تغییر بده!",
                "این محصول داغه، از دستش نده!",
                "همانطور که خورشید پس از شب طلوع می‌کند، موفقیت نیز پس از شکست و مشکلات ظاهر می‌شود.",
                "اگر فردی به موفقیت برسد، این بدان معناست که دیگران از جمله من هم می‌توانم به آن برسم.",
                "فکر، احساس و رفتار مثبت هزینه‌ای ندارد. هم‌چنین فکر، احساس و رفتار منفی خرجی ندارد پس چرا فکر، احساس و رفتار مثبت را انتخاب نکنم؟",
                "اگر خواهان موفقیت هستید، به جای ناله و شکایت، برنامه‌ریزی کنید و به آن‌ها عمل کنید.",
                "اگر شیوه زندگی خود را دوست ندارید، در زندگی‌تان تغییر ایجاد کنید. شما می‌توانید سبک زندگی متفاوتی داشته باشید. شما به انگیزه، برنامه ریزی مناسب و پشتکار نیاز دارید.",
                "هر فکر و احساس و حرفی که می‌زنید، خودتان و دیگران را تحت تأثیر قرار می‌دهد پس دقت کنید که به چه فکر می‌کنید، چه احساسی دارید و چه می‌گویید.",
                "من قدردان تمام چیزهای خوب در زندگی‌ام هستم و بابت آن‌ها شکرگزارم.",
                "من می‌توانم هر مهارتی را یاد بگیرم و در هر زمینه‌ای می‌توانم پیشرفت کنم.",
                "وقتی صبح از خواب برمی‌خیزید به خود بگویید امروزتان چقدر شگفت‌انگیز است. جملات تاکیدی مثبت را تکرار کنید و به آن‌ها ایمان داشته باشید.",
                "وقتی شب به رختخواب می‌روید به خود بگویید که فردا روز شگفت‌انگیزی خواهید داشت.",
                "افکار و احساسات مثبت را جایگزین افکار و احساسات منفی کنید. هرچند این کار مشکل است، تسلیم نشوید. فقط به این کار ادامه دهید تا برایتان به یک عادت بدون زحمت تبدیل شود.",
                "وقتی ذهنیت خود را تغییر می‌دهید و به افکار بهتر و شادتر رجوع می‌کنید، به همین ترتیب زندگی‌تان تغییر می‌کند.",
                "اگر امروز با مشکلاتی مواجهه هستید، آن را یک چالش در نظر بگیرید و به جای غصه خوردن، با انرژی در جستجوی راه حل باشید.",
                "اگر بگویید “من نمی‌توانم” ذهنتان فرصت‌ها را نمی‌بیند و در جایگاهی که هستید باقی می‌مانید. اما اگر بگویید “من می‌توانم” فرصت‌ها را پیدا می‌کنید و رو به جلو حرکت می‌کنید.",
                "اگر کاری را نتوانستم انجام دهم، از آن درس می‌گیرم.",
                "اگر شما منتظر پیدا شدن فرصت هستید، آن را می‌یابید. باید ذهنتان را تغییر دهید.",
                "در زندگی روزمره‌تان همیشه چیزهای کوچکی هستند که می‌توانید به شیوه‌ای متفاوت آن‌ها را انجام دهید. با انجام این کار زندگی‌تان جذاب‌تر می‌شود.",
                "عاشق زندگی بودن کلید ابدی جوانی است. ",
                "شما برای مدتی کوتاه اینجا هستید، نترسید و نگران نباشید و با اطمینان در طول مسیر به گلها لبخند بزنید. ",
                "فردی که جرات هدر دادن یک ساعت را دارد، ارزش زندگی را درک نکرده است. ",
                "اگر زندگی قابل پیش بینی باشد، متوقف و بی معنی خواهد بود. t",
                "تمام زندگی تجربه کردن است. هرچه بیشتر تجربه کنید بهتر است. ",
                "تمام زندگی دارای پستی و بلندی است، به پستی ها اجازه ندهید شما را به پایین کشیده و در بالایی ها خیلی بالا نروید. ",
                "از زندگی الهام بگیرید، حس محض زندگی لذتی بی شمار است. ",
                "ماموریت من در زندگی فقط زنده ماندن نیست، بلکه پیشرفت است و برای آن باید، شور و هیجان، دلسوزی، طنز و روش منحصر بفرد داشت. ",
                "با اینکه زندگی سخت به نظر می رسد ولی همیشه می توانید کاری انجام داده و موفق شوید.",
                "زندگی مانند دوچرخه سواری است. برای نگهداشتن تعادل آن باید حرکت کنید. ",
                "هر چه بیشتر زندگی را ستایش کنید چیزهای بیشتری در زندگی برای جشن گرفتن به وجود می آید. ",
                "مهم ترین چیز برای لذت بردن از زندگیتان شاد بودن است. ",
                "هر اتفاقی که می افتد از زندگی لذت می برم، به خوب و بد بودن آن توجه نمی کنم این یعنی زنده هستیم. ",
                "زندگی کوتاه است، اینکه شیرین باشد به شما بستگی دارد. ",
                "زندگی نمی خواهد که ما بهترین باشیم، کافیست بهترین تلاش خود را انجام دهیم..",
                "همیشه دوست دارم به قسمت خوشبینانه زندگی بنگرم، اما به اندازه کافی واقع گرا هستم که بدانم زندگی بسیار پیچیده است. ",
                "واقعیت این است که نمی دانید فردا چه رخ می دهد. زندگی یک مسیر دیوانه وار است و چیزی تضمین شده نیست. ",
                "فقط باید بفهمید چه زمانی واقعا طالب موفقیت هستید؛ چون دیگر هیچوقت تسلیم نمی شوید و مهم نیست آنوقت دیگر شرایط چقدر رو به سختی برود. ناشناس",
                "مسولیت زندگیتان را به عهده بگیرید. این را بدانید … فقط شما هستید که میتوانید خودتان را به جایی که میخواهید برسانید، نه هیچکس دیگری. ",
                "من از کارهایی که کردم هیچوقت پشیمان نمی شوم، اما از شانس‌هایی که برای انجام یک سری کارها داشتم و هیچ کاری باهاشون نکردم پشیمانم. ناشناس",
                "سخته منتظر چیزی باشی که میدونی هیچوقت اتفاق نمی افته و سخت‌تر از آن وقتیه که دربرابر چیزی که تمام آن چیزی است که می‌خواستی، بخوای تسلیم بشی. ناشناس",
                "یکی از کلیدهای موفقیت، داشتن نظم در انجام دادن کارهایی است که باید انجام دهید؛ حتی اگر میلی به انجامش ندارید… اما میدانید مهم هستند و باید انجام شوند. برایان تریسی",
                "افرادی که صبر خوبی دارند، اتفاقات خوبی برایشان رخ میدهد و اتفاقات عالی برای افرادی که اتفاقات عالی را خودشان با تلاش خودشان محقق میکنند. جورج فورمن لوکاس",
                "خوشبختی نمیتونه مسافرت کردن باشه، داشتن باشه، بدست آوردن باشه یا حتی پوشیدن! خوشبختی یک تجربه معنوی از زندگی کردن هر دقیقه از زندگیتان با عشق، لذت و قدردانی است. دنیس ویتلی",
                "راه حل صحیح موفقیت این است که اشتیاق شما به پیروزی بیشتر از ترس شما از شکست باشد. انیشتین",
                "جاهایی بروید که مورد توجه واقع شوید، نه مورد تحمل؛ اگر آنها ارزش واقعی شما را نمیدانند پس دیگر وقتش است یک شروع جدید در روابطتان داشته باشید. جیم ران",
                "هیچوقت از داشتن عقاید متفاوت با توافق جمع نترسید، حتی وقتی که تنها فرد موجود با همچین اعتقادی باشید. رابین شارما",
                "بهترین انتقام، یک موفقیت عظیم است. فرانک سیناترا",
                "به تمام دلایلی که موفق نمی‌شوید فکر نکنید… فقط به ۱ دلیلی فکر کنید که میدانید موفق می‌شوید. هنر فورد",
                "از همه افرادی که در زندگیم دست رد به سینه‌ام زدند سپاس‌گزارم، به همان علت بود که کارهایم را خودم انجام دادم و الان در این جایگاه قرار دارم. آلبرت اینشتین",
                "تنها راه انجام دادن کارهای عظیم، دوست داشتن کاری است که می‌کنید. اگر تا الان آن را پیدا نکردید، به گشتنتان ادامه دهید و تا زمانی که آن را پیدا نکردید، متوقف نشوید. استیو جابز",
                "عمر کوتاه است پس زندگی کنید. عشق کمیاب است، پس به چنگش بیاورید. خشم بد است، عاشق شوید. ترس ترسناک است، تا زمانی که باهاش مقابله نکردید. خاطرات شیرینند پس قدرشان را بدانید. اوژن فودور",
                "من به خود و توانایی‌هایم برای یافتن عشق، پیشرفت در کار و دستیابی به موفقیت ایمان دارم.",
                "من قادر هستم که تمام تلاشم را برای دنبال کردن رویاها و اهدافم و تبدیل کردن آن‌ها به واقعیت به کار گیرم.",
                "شادی، عشق و آرامش را به زندگی‌ام دعوت می‌کنم.",
                "من هرروز عشق و شادی را در زندگیم با آغوش باز می‌پذیرم.",
                "با آغوشی باز به سوی تجارب و فرصت‌های جدید می‌روم.",
                "فرصت‌های بی‌شماری دارم و من بهترین آن‌ها را برمی‌گزینم.",
                "عشق، شادی و مهربانی را به همه ارزانی می‌کنم و همین عشق، شادی و مهربانی را از آن‌ها دریافت می‌کنم.",
                "عشق، شادی و موفقیت را به دوستان، خانواده‌ام حتی کسانی که از من خوششان نمی‌آید، می‌بخشم.",
                "روز به روز در زندگی‌ام پیشرفت را احساس می‌کنم.",
                "یاد گرفته‌ام هر چیزی را بدون قضاوت و دلخوری بپذیرم.",
                "ماندن در گذشته سودی ندارد، هرچه در گذشته رخ داده تمام شده و الان گذشته‌ای وجود ندارد. پس از زمان حال لذت ببرید.",
                "هرچه زودتر بتوانید از گذشته فارغ شوید، زودتر حال و آینده را تحت کنترل خود درمی‌آورید.",
                "وقتی گذشته را رها کنید، فرصت‌های جدیدی می‌سازید.",
                "باور داشته باشید که حتی هنگام ناکامی و ناامیدی هم می‌شود به موفقیت رسید. اگر این تصور ذهنی را داشته باشید، حتما به آن دست پیدا می‌کنید.",
                "باور به اینکه می‌توانید موفق شوید، شما را به آسانی به جلو می‌برد و انگیزه می‌دهد تا به سمت حرکت کنید.",
                "وقتی خودتان را باور دارید، نظر دیگران نسبت به شما و رفتارهایتان اهمیتی ندارد.",
                "وقتی میگید سخته مترادف جمله “من به قدر کافی قوی نیستم تا براش بجنگم” است، بس کنید این حرف‌های مزخرف رو، مثبت باشید و هرچقدر هم سخت باشه، باید بروید بیرون و بدستش بیارید. وینس لومباردی",
                "زندگی مانند دوربین عکاسی است، شما باید حداقل یک عکس خام درش بگذارید تا یک عکس از چیزی که می‌خواهید به شما تحویل دهد. تیموتی اسکات",
                "برای شکست‌هایتان زیاد ناراحت نشوید، برای فرصت‌هایی که بدون امتحان کردنشان از دست می‌دادید ناراحت باشید. جک کنفیلد",
                "درد امروزتان، می‌تواند تبدیل به نقطه قوت‌تان در آینده‌تان شود، برای هر چالش، رویارویی با آن فرصتی برای رشدتان خواهد بود. لس براون",
                "رویای خودتون رو بسازید، وگرنه کسی شما را استخدام می‌کند تا رویای او را بسازید. فرح گری",
                "تنها شکافی که بین شما و رویایتان قرار دارد با کمی اراده به عمل و کمی اعتقاد راسخ پر می‌شود. جویل براون",
                "اعتمادبنفس جذاب‌ترین صفتی است که یک نفر می‌تواند داشته باشد. چطور کسی می‌تواند ببیند شما چقدر فوق‌العاده‌اید وقتی خودتان نتوانید ببینید؟ ناشناس",
                "ما از آدم‌هایی که وارد زندگیمان می‌شوند چیزهایی یاد می‌گیریم، حالا بعضی درس‌ها سخت بدست می‌آید بعضی درس‌ها بدون سختی؛ اما در آخر همه‌شان بی‌قیمتند…ل",
                "شاد بودن به این معنا نیست که همه چیز خوب است، شاد بودن به این معناست که شما تصمیم گرفتید فراتر از هرآنچه کامل نیست را ببینید.",
                "هیچکس تا به حال برنامه‌ای برای شکست خوردن، چاق شدن یا احمق بودن ننوشته! ",
                "از تغییر نترس اولش سخته ولی نتیجه خوبی داره "
            ];
            return $alert[array_rand($alert)];

        }
        
        add_action( 'save_post', 'saveRandomText' );
        
        function saveRandomText($post_id){
            if(get_post_type($post_id) != 'product'){
                return;
            }
            
            $slogan = get_post_meta($post_id,'stone_slogan');
            if(empty($slogan)){
                update_post_meta($post_id,'stone_slogan',random_alert());
            }
            return;
        }
        
        add_action('woocommerce_before_single_product_summary', 'showSlogan',10);
        
        function showSlogan($post_id){
            global $post;
        
            // دریافت پست متای 'slogan' برای محصول فعلی
            $slogan = get_post_meta($post->ID, 'stone_slogan', true);
        
            if ($slogan) {
                // نمایش اسلوگان
                echo '<p class="product-slogan">' . esc_html($slogan) . '</p>';
            }
        }